zeha/xc32/pic32c-source/XC32-arm-gcc/binutils/bfd/pic32c-allocate.c
/*
** pic32c-allocate.c
**
** Copyright (c) 2016 Microchip Technology, Inc.
**
** This file is part of BFD, the Binary File Descriptor library.
**
** This program is free software; you can redistribute it and/or modify
** it under the terms of the GNU General Public License as published by
** the Free Software Foundation; either version 3 of the License, or
** (at your option) any later version.
**
** This program is distributed in the hope that it will be useful,
** but WITHOUT ANY WARRANTY; without even the implied warranty of
** MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
** GNU General Public License for more details.
**
** You should have received a copy of the GNU General Public License
** along with this program; if not, write to the Free Software
** Foundation, Inc., 51 Franklin Street - Fifth Floor, Boston,
** MA 02110-1301, USA.
**
** This file contains pic32-specific memory allocation
** processing for the linker.
**
** It is included by the following target-specific
** emulation files:
**
**   ld/emultmpl/elf32pic32mx.em
**
*/

/*****************************************************************************
**
** Improved Memory Allocation Routines
**
** These functions implement the improved
** memory allocator .
**
*/

/* useful constants and macros */
#define NEAR_BOUNDARY   0xa0010000

#define VALID_NEAR(addr, len) ((bfd_vma)(addr)+(len) <= NEAR_BOUNDARY)

#define VALID_LOW_ADDR(addr, len)  ((bfd_vma)(addr)+(len) <= exclude_addr)
#define VALID_HIGH_ADDR(addr, len)  ((bfd_vma)(addr) >= exclude_addr)

/* Create an id for each section attribute */
#define ATTR(a,b,c)  _##a,
 enum {
#include "pic32c-attributes.h"
 } ;

/* Create a bit mask for each section attribute */
#undef ATTR
#define ATTR(a,b,c)  a = (1<<_##a),
 enum {
#include "pic32c-attributes.h"
 } ;

/* Create a bit mask to match any attribute */
#define all_attr 0xFFFFFFFF

/* \lghica coresident*/
//extern bfd_boolean pic32_coresident_app;

/* Memory allocator options  */
enum {
  NO_LOCATE_OPTION,
  FAVOR_LOW_ADDR,     /* scan free blocks from low addr only  */
  FAVOR_HIGH_ADDR,    /* scan free blocks from high addr only */
  EXCLUDE_LOW_ADDR,   /* avoid memory below LIMIT             */
  EXCLUDE_HIGH_ADDR,  /* avoid memory above LIMIT - 1         */
  LOCATE_HIGHEST,
};

/* Data structure for free program memory blocks */
extern struct pic32_memory *program_memory_free_blocks;
extern bfd_vma     pic32c_itcm_vectors_address;
extern unsigned int         pic32c_itcm_size;

static void allocate_stack_in_dtcm();

static void
finish_section_info(struct pic32_section *s, lang_output_section_statement_type *os);

static int locate_options = 0;
static bfd_vma exclude_addr = 0;
static bfd_vma ramfunc_begin = 0;

static void
set_locate_options(int optionvalue, bfd_vma addr) {
  locate_options = optionvalue;
  exclude_addr = addr;
}

static void
reset_locate_options(void) {
  locate_options = NO_LOCATE_OPTION;
  exclude_addr = 0;
}

#define IS_LOCATE_OPTION(a)  ((locate_options & (a)) == (a))

static void
remove_section_from_bfd(bfd *abfd, asection *sec)
{
    asection *s, *prev;
    
    s = abfd->sections;
    if ((s == NULL) || (s->next == NULL)) return;
    
    /* as a sanity check, search for the section in the bfd */
    /* this can be removed or made optional if speed is an issue */
#if 1
    /* lookup 'sec' starting with 2nd bfd section (never remove the 1st one) */
    s = s->next;
    while (s != sec && s != NULL)
        s = s->next;
    /* didn't find it */
    if (s == NULL)
#else
    /* simple test for not removing the 1st section */
        if (sec->prev == NULL)
#endif
            return;
    
    prev = sec->prev;
    prev->next = sec->next;
    
    if (sec->next)
        sec->next->prev = prev;
    else
        abfd->section_last = prev; /*update the bfd->section_last field
                                    if the removed section is the
                                    last section.*/
    abfd->section_count -= 1;
    if (pic32_debug)
        printf("    removing section %s\n", s->name);
    return;
} /* static void remove_section_from_bfd (...)*/

/*
 * reserve_space_for_vectors()
 *
 * This function reserve the beginning of itcm region for a copy of
 * .vectors section
 *
 * Called by: allocate_program_memory()
 *
 * Calls:     region_lookup()
 *            bfd_get_section_by_name()
 *            pic32_static_assign_memory()
 *
 */
void reserve_space_for_vectors()
{
    ///\ itcm region lookup
    struct memory_region_struct     *region = region_lookup("itcm");
    ///\ get .vectors
    asection                        *vectors_section =
    bfd_get_section_by_name(link_info.output_bfd, ".vectors");
    struct pic32_memory             *vectors_block = NULL;
    
    ///\ no itcm specified in the linker script
    if ((region == NULL) || (pic32c_itcm_size == 0))
        return;
    
    if (vectors_section == NULL)
        return;
    
    ///\ keep the itcm->origin for .dinit dump
    pic32c_itcm_vectors_address = region->origin;
    
    ///\ allocate .vectors as an absolute section
    vectors_block = pic32_static_assign_memory(free_blocks,
                                               vectors_section->size,
                                               pic32c_itcm_vectors_address);
    if (vectors_block == NULL)
        einfo("%X Could not allocate .vectors at the beginning of itcm\n");
    
    create_remainder_blocks(free_blocks,vectors_block, vectors_section->size);
}


static void generate_flash_vectors_symbol(char * const name)
{
    // add a symbol for .vectors if it was in the ld script
    asection   *vectors_section =
                bfd_get_section_by_name(link_info.output_bfd, ".vectors");
    if (vectors_section != NULL) {
	_bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd, name,
					  BSF_GLOBAL, bfd_abs_section_ptr,
					  vectors_section->lma,
					  name, 1, 0, 0);
    }
}

static void generate_vectors_symbols()
{

    generate_flash_vectors_symbol("__svectors_nvm");
    
    ///\ generate itcm .vectors symbol
    _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd, "__svectors",
                                BSF_GLOBAL, bfd_abs_section_ptr,
                                pic32c_itcm_vectors_address,
                                "__svectors", 1, 0, 0);
    
