zeha/xc32/pic32c-source/XC32-arm-gcc/binutils/bfd/pic32c-allocate.c
            if (pic32_debug) {
              printf("  Merging output sections %s and %s\n",
                      sec->name, next_sec->name);
              printf("    %s: addr = %lx, len = %lx\n",
                     sec->name, sec->lma, sec_len + merge_len);
              printf("    %s: addr = %lx, len = %lx\n",
                     next_sec->name, next_sec->lma, next_len);
            }

            merge_sec = 1; /* set a flag to indicate we're merging */
            merge_len += next_len;
            next->output_section_statement.children.head->
              input_section.section->output_section = NULL;

            lang_add_section (&os->output_section_statement.children,
                              next->output_section_statement.children.head
                              ->input_section.section,
                              NULL,
                              &os->output_section_statement);

            /* remove the merged section from output_bfd */
            remove_section_from_bfd(link_info.output_bfd, next_sec);
          }
        }
      }

      if (merge_sec) {
        if (!(os->header.next = next->header.next)) /* unlink the merged statement */
          /* update statement_list.tail if we just removed/merged the last stmt */
          statement_list.tail = &os->header.next;

        /* there's another (doubly) linked list containing only the output section */
        /* statements so also update its links and the tail address when the last */
        /* output statement is removed / merged */
        if (!(os->output_section_statement.next = next->output_section_statement.next))
          lang_output_section_statement.tail = &os->output_section_statement.next;
        else
          os->output_section_statement.next->prev = os;
        next = os;                            /* try to merge another one */
      }
    }
  }

} /* allocate_memory() */


/*
 * allocate_program_memory()
 *
 * This function attempts to allocate program memory sections.
 *
 * Called by: allocate_memory()
 *
 * Calls:     build_alloc_section_list()
 *            build_free_block_list()
 *            locate_sections()
 *            pic32_section_list_length()
 *
 * Returns:   status code
 *            (0 = success)
 */
static int
allocate_program_memory() {
  struct memory_region_struct *region;
  unsigned int mask = code | itcm;
  int result = 0;

  if (pic32_debug)
    printf("\nBuilding allocation list for regions \"program\" and \"itcm\"\n"
           "  attribute mask = %x\n", mask);

  build_alloc_section_list(mask);
  if (pic32_section_list_length(alloc_section_list) == 0)
    return result;

  if (pic32_debug) {
    pic32_print_section_list(alloc_section_list, "allocation");
  }

    
    
// now we try to allocate the list of input sections we just built to ROM and ITCM
// first we allocate to ROM blocking any sections marked ITCM
// then we do it all again to itcm

    ///\ LG to fix    (to fix what? - JLM)
  region = region_lookup ("rom");

  if (region->length == ~(bfd_size_type) 0) {
      program_memory_free_blocks = NULL;
      
      // do not bother going further if rom was not defined in the linker script ...
      if (pic32_debug)     printf("no section named rom : not proceeding with BF allocation\n");
      return 0;
    
  }

  build_free_block_list(region, mask);

  reset_locate_options();

  result |= locate_sections(address, itcm, region);   /* most restrictive  */

  result |= locate_sections(all_attr, itcm, region);  /* less restrictive */

  /* save the free blocks list */
  program_memory_free_blocks = free_blocks;
    
  region = region_lookup ("itcm");

  if ((region != NULL) && (region->length != 0)
      && (region->length != ~(bfd_size_type) 0))
  {
  
      build_free_block_list(region, mask);
      
      ///\ reserve space at the beginning of itcm for .vectors
      reserve_space_for_vectors();
      
      generate_vectors_symbols();
      
      reset_locate_options();

      result |= locate_sections(address, 0, region);   /* most restrictive  */

      result |= locate_sections(all_attr, 0, region);  /* least restrictive */
      
  }
    else if (((region = region_lookup("tcm")) != NULL)
             && (region->length != 0)
             && (region->length != ~(bfd_size_type) 0))
    {
        build_free_block_list(region, mask);
        reset_locate_options();
        
        result |= locate_sections(address, 0, region);   /* most restrictive  */
        
        result |= locate_sections(all_attr, 0, region);  /* least restrictive */
    }
    ///\ if itcm is not enabled, generate only the .vectors flash symbols
    else
    {
        generate_flash_vectors_symbol("__svectors_nvm");
        generate_flash_vectors_symbol("__svectors");
    }

  free_blocks = 0;

  return result;
} /* allocate_program_memory() */



/*
 * allocate_data_memory()
 *
 * This function attempts to allocate data memory sections.
 *
 * Called by: allocate_memory()
 *
 * Calls:     build_section_list()
 *            build_free_block_list()
 *            locate_sections()
 *
 * Returns:   status code
 *            (0 = success)
 *
 * Notes: List "data_memory_free_blocks" is needed by
 *        bfd_pic322_finish() to allocate the stack
 *        and heap, so don't exit this function early.
 *
 *        EDS allocation is tricky. Although these sections
 *        can be allocated anywhere, we need to preserve
 *        low memory for the stack. In the first pass,
 *        we exclude memory below the stack limit altogether.
 *        In the second pass, we scan free blocks in reverse
 *        only, which helps when a block crosses the
 *        stack limit boundary. Eventually we'll take
 *        whatever memory we need to, and leave the rest
 *        for the stack and heap.
 *
 *        We also support allocation of stack and heap
 *        that are defined with section attributes.
 *
 *        See comments below for additional info
 *        about stack allocation.
 */
static int
allocate_data_memory() {
  struct memory_region_struct *region = NULL;
  struct memory_region_struct *dtcm_region = NULL;
  struct pic32_section *s;
  unsigned int mask = data|bss|persist|stack|heap|ramfunc;
  int result = 0;

  // build a list of data sections to be allocated - includes tcm and non-tcm

