zeha/xc32/pic32c-source/XC32-arm-gcc/binutils/bfd/pic32c-allocate.c
  if (pic32_debug)
    printf("\nBuilding allocation list for region \"data\"\n"
           "  attribute mask = %x\n", mask);

  build_alloc_section_list(mask);

  if (pic32_debug) {
    pic32_print_section_list(alloc_section_list, "allocation");
  }



  // now we allocate the sections on the list to ram or dtcm as needed
  // 
  // region lookup populates the variable free_block_list with the free blocks from region.
  // there is only one such variable, so we can only allocate to one region at a time.
  // We allocate first to ram, providing dtcm as the "block" parameter - then we do it all again
  // to dtcm

  region =  region_lookup ("ram");

   if (region->length == ~(bfd_size_type) 0) {
      // do not bother going further if  ram was not defined in the linker script ...
       data_memory_free_blocks = NULL;
      if (pic32_debug)     printf("no section named ram : not proceeding with BF allocation\n");
      return 0; 
  }

  if (region == NULL)
    einfo (_(" Link Error: missing mem region for device"));

  build_free_block_list(region, mask);

  reset_locate_options();

  result |= locate_sections(address, dtcm, region);

  result |= locate_sections(all_attr, stack|heap|dtcm, region);


    /* save the free blocks list */
    /* needed for further heap/stack checks */
    data_memory_free_blocks = free_blocks;
    free_blocks = 0;
    
    
  region =  region_lookup ("dtcm");

  if ((region != NULL) && (region->length != 0)) {

      build_free_block_list(region, mask);

      reset_locate_options();

      result |= locate_sections(address , 0, region);

      result |= locate_sections(dtcm, stack|heap, region);

      if (pic32c_stack_in_tcm)
          allocate_stack_in_dtcm();

      free_blocks = 0;
  }
  else if (((region = region_lookup("tcm")) != NULL)
           && (region->length != 0))
  {
      build_free_block_list(region, mask);
      
      reset_locate_options();
      
      result |= locate_sections(address , 0, region);
      
      result |= locate_sections(dtcm, stack|heap, region);
      
      if (pic32c_stack_in_tcm)
          allocate_stack_in_dtcm();
      
      free_blocks = 0;
  }
  
#if 0
  /* user-defined heap */
  if (ramfunc_begin != 0) {
    set_locate_options(EXCLUDE_HIGH_ADDR, ramfunc_begin);
  }
  result |= locate_sections(heap, 0, region);

  /* user-defined stack */
  if (ramfunc_begin != 0) {
    set_locate_options(EXCLUDE_HIGH_ADDR, ramfunc_begin);
  }
  result |= locate_sections(stack, 0, region);
#else
  /* Don't support user-defined stack sections yet */
  for (s = alloc_section_list; s != NULL; s = s->next) {
      /* lghica co-resident */
#if 1
      if(s && (s->sec != NULL) && (s->sec->linked))
          continue;
#endif
    if (s->sec && (PIC32_IS_STACK_ATTR(s->sec) || PIC32_IS_HEAP_ATTR(s->sec))) {
      lang_output_section_statement_type *os;
      s->sec->lma = 0;
      s->sec->vma = 0;
      os = lang_output_section_statement_lookup (".stack", 0, TRUE);
      /* lang_add_section() will call init_os() if needed */
      lang_add_section (&os->children, s->sec, NULL, os);
      finish_section_info(s, os);
      pic32_remove_from_section_list(alloc_section_list,s);
      os->bfd_section->flags = s->sec->flags;
    }
  }

#endif

  /* if any sections are left in the allocation list, report an error */
  for (s = alloc_section_list; s != NULL; s = s->next) {
  if ((s->attributes != 0) && (s->sec->linked == 0) /* lghica co-resident*/)
  {
    report_allocation_error(s);
    result = 1;
    break;
  }
  }


  return result;
} /* allocate_data_memory() */

static bfd_vma
group_section_size(struct pic32_section *g)
{
  struct pic32_section *s,*next;
  bfd_vma result = 0;

  for (s = g; s != NULL; s = next) {
    next = s->next;
    if (s->sec == 0)
      continue;
    if (s->sec && (PIC32_IS_RAMFUNC_ATTR(s->sec)))
      result += s->sec->size;
  }
  return result;
}

#define OUTSIDE_REGION(addr, len, region)          \
  (((addr + len) <= region->origin)                \
   || (addr >= (region->origin + region->length)))

#define ACROSS_REGION(addr, len, region)                            \
  (((addr < region->origin) && ((addr + len) > region->origin)) ||  \
   ((addr < (region->origin + region->length)) &&                   \
    ((addr + len) > (region->origin + region->length))))


/*
 * locate_group_section()
 *
 * Helper function to locate a grouped section
 * using the free_blocks list.
 *
 * Called by: locate_sections()
 *
 * Returns:   status code
 *            (0 = success)
 */

 static int
 locate_group_section(struct pic32_section *s,
                        struct memory_region_struct *region) {

  struct pic32_memory *b;
  bfd_vma len = group_section_size(s);
  bfd_vma addr = s->sec->lma;
  int result = 0;

  /* DEBUG */
  if (pic32_debug)
    printf("  group section \"%s\", total size = %lx\n",
           s->sec->name, len);

  /* look for tricky user error */
  if (PIC32_IS_ABSOLUTE_ATTR(s->sec) && ACROSS_REGION(addr, len, region))
        einfo(_(" Link Warning: absolute section \'%s\' crosses"
                " the boundary of region %s.\n"),
              s->sec->name, region->name_list.name);

  if (len == 0)
    update_group_section_info(0,s,region); /* trivial case */
  else if (PIC32_IS_ABSOLUTE_ATTR(s->sec) &&
           OUTSIDE_REGION(addr, len, region)) {
    update_group_section_info(addr, s, region);  /* falls outside region */
  }
  else {                          /* locate using free_blocks list */
    b = select_free_block(s, len);
    if (b) {
      addr = b->addr + b->offset;
#if 0 ///\ LG
    /* Translate the address from kseg0 to kseg1 */
      if (PIC32_IS_COHERENT_ATTR(s->sec))
        addr |= 0x20000000u;
#endif
      update_group_section_info(addr,s,region);
      create_remainder_blocks(free_blocks,b,len);
      remove_free_block(b);
    } else {
      if (locate_options != NO_LOCATE_OPTION) {
        if (pic32_debug)
          printf("    \"%s\" location declined\n", s->sec->name);
        return 0;
      }
      result |= 1;
    }
  }

