zeha/xc32/pic32c-source/XC32-arm-gcc/binutils/bfd/pic32c-allocate.c
  if (pic32_debug)
    printf("\nBuilding free block list for region \"%s\"\n"
           "  origin = %lx, length = %lx, current = %lx\n",
           region->name_list.name, region->origin, region->length, region->current );

  /* find any gaps left by sequential allocator */
    dot = region->origin;
  limit = dot + region->length;
  for (s = pic32_section_list; s != NULL; s = s->next) {

      if (pic32_debug && s->sec)
        printf("    Checking (section \"%s\", lma = %lx, vma = %lx, len = %lx, attr = %x)\n",
               s->sec->name, s->sec->lma, s->sec->vma,
               s->sec->rawsize? s->sec->rawsize : s->sec->size,
               s->attributes);

    if (s->sec && (s->use_vma==0) &&
        (s->sec->lma >= region->origin)
        && (s->sec->lma <= (region->origin + region->length))
        && (s->sec->lma!=0)
        )
        ma = s->sec->lma;
    else if (s->sec && (s->use_vma) &&
        (s->sec->vma >= region->origin) &&
           (s->sec->vma <= (region->origin + region->length)))
        ma = s->sec->vma;
    else
        ma = 0;

    if ((s->sec) && ((s->sec->rawsize | s->sec->size) > 0) &&
        (ma || ( (s->sec->lma == 0x0) && (region->origin == 0x0)))
        ) {
      if (pic32_debug)
        printf("    (section \"%s\", addr = %lx, len = %lx, attr = %x)\n",
               s->sec->name, ma,
               s->sec->rawsize? s->sec->rawsize : s->sec->size,
               s->attributes);
      if (ma == dot)                   /* no gap, just advance dot */
        dot += s->sec->rawsize? s->sec->rawsize : s->sec->size;
      else if (ma >= limit)   /* section belongs to another region */
        continue;
      else if (ma > dot) {               /* a gap preceeds section */
        len = ma - dot;                          /* compute length */
        if (pic32_debug)
          printf("  block %d, addr = %lx, len = %lx\n",
                 ++cnt, dot, len);
        pic32_add_to_memory_list(free_blocks, dot, len);  /* add free block */
        dot += len + (s->sec->rawsize? s->sec->rawsize : s->sec->size);           /* advance dot    */
      }
    }
  }

  /* add a block for any free space remaining in this region */
  /* .. use dot, because region->current may have been set for CodeGuard */
  len = region->length - (dot - region->origin);
  if (len > 0) {
    if (pic32_debug)
      printf("  block %d, addr = %lx, len = %lx\n",
             ++cnt, dot, len);
    pic32_add_to_memory_list(free_blocks, dot, len);
  }
} /* build_free_block_list() */


/*
 * remove_free_block()
 *
 * Remove an item from the free memory blocks list.
 *
 */
static void
remove_free_block(struct pic32_memory *b) {
  pic32_remove_from_memory_list(free_blocks, b);
}


/*
 * allocate_default_stack()
 *
 * If a stack section was not explicitly defined,
 * and the stack init symbols were not defined,
 * then this function is called to allocate the
 * largest stack possible from data_memory_free_blocks.
 *
 * Called by: bfd_pic32_finish()
 *
 * Calls:     pic32_add_to_memory_list()
 *            pic32_remove_from_memory_list()
 *
 * Returns:   sets global vars stack_base, stack_limit
 *
 * Notes: The free blocks list is sorted in order
 *        of increasing size
 *
 *        The calling function will confirm that
 *        the resulting stack satisfies the minimum
 *        size requirements.
 *
 *
 */

static void
allocate_default_stack() {
  struct pic32_memory *big_block = 0;
  struct pic32_memory *b, *next;
  bfd_vma under,over;
#define DATA_MEM_LIMIT      0x2045FFFFul;
  bfd_vma max_addr = DATA_MEM_LIMIT;

  if (data_memory_free_blocks == NULL) {
      einfo("%P%F: Error: Unable to allocate stack. No blocks available in RAM. \n");
      return;
        
  }
    
    
  /* if a free block straddles the upper limit, divide it */
  for (b = data_memory_free_blocks; b != NULL; b = next) {
    next = b->next;
    if ((b->addr < max_addr) && ((b->addr + b->size) > max_addr)) {

      if (pic32_debug)
        printf("  free block at %lx crosses upper stack limit (%lx)\n",
               b->addr, max_addr);

      under = max_addr - b->addr;
      over  = (b->addr + b->size) - max_addr;

      pic32_add_to_memory_list(data_memory_free_blocks, b->addr, under);
      pic32_add_to_memory_list(data_memory_free_blocks, max_addr, over);
      pic32_remove_from_memory_list(data_memory_free_blocks, b);
      break;
    }
  }

  /* find the largest block that qualifies */
  for (b = data_memory_free_blocks; b != NULL; b = next) {
    if (b->addr < max_addr)
      big_block = b;
    next = b->next;
  }

  if ((unsigned int)(pic32c_heap_size) >
      (unsigned int)big_block->size) {
    heap_base = (big_block->addr + 1);
    heap_limit = (heap_base + (big_block->size) - 0x80u);
    einfo("%P%X Error: Not enough memory for heap"
          " (0x%x bytes needed, 0x%x bytes available)\n",
            (unsigned int)(pic32c_heap_size),
            (unsigned )(heap_limit - heap_base));
  } else {
    heap_base = (big_block->addr + 1);
    heap_limit = (heap_base + pic32c_heap_size);
  }
  while (heap_base % 8 != 0)
    heap_base++;
  while (heap_limit % 8 != 0)
    heap_limit++;

  stack_base  = (heap_limit + 1 + pic32c_stackguard_size);
  stack_limit = (heap_base + big_block->size
                 - pic32c_stackguard_size + 1);
  /* Stack must be aligned by 8 */
  while (stack_base % 8 != 0)
    stack_base++;
  while (stack_limit % 8 != 0)
    stack_limit--;

  if (pic32_debug) {
    printf("  selecting block at %lx\n", big_block->addr);
    printf("  heap base = %x, heap limit = %x\n", heap_base, heap_limit);
    printf("  stack base = %x, stack limit = %x\n", stack_base, stack_limit);
  }

  /* remove the block that we just used */
  pic32_remove_from_memory_list(data_memory_free_blocks, big_block);
}

static void allocate_stack_in_dtcm()
{
    struct pic32_memory     *block = NULL;
    struct pic32_memory     *iter;
    unsigned int            max_size = 0;
    
    ///\ lookup for dtcm region
    struct memory_region_struct   *dtcm_region = region_lookup("dtcm");
    
    
